# -*- coding: utf-8 -*-
"""Копия блокнота "PythonUrban_lab_1.ipynb"

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1_3f1F2SqL3Bm4qZJjKwNo33naNcRk3rt

## list comprehension

### Обработка каждого элемента
"""

cart = [3, 4, 12, 17, 19, 21, 23, 26, 30]

cashier = []  # новый список с помощью метода append
for item in cart:
    cashier.append(item)
print(cashier)

cashier = [item for item in cart]
print(cashier)

"""![](https://github.com/mrdbourke/python-list-comprehensions-tutorial/raw/f68f956c745932e1b824a69994706d715adde0a1/images/list-comprehensions-1.png)

### Фильтрация элементов
"""

cart = [5, 7, 9, 10, 12, 15, 19, 20, 22]

cashier_3 = []
for item in cart:
    if item % 2 == 0:  # только четные
        cashier_3.append(item)
print(cashier_3)

cashier_3 = [item for item in cart if item % 2 == 0]
print(cashier_3)

"""![](https://github.com/mrdbourke/python-list-comprehensions-tutorial/raw/f68f956c745932e1b824a69994706d715adde0a1/images/list-comprehensions-2.png)

## Задачи

##### ***Задача 1. Сделать название городов с заглавной буквы.***
Написать функцию task_1, которая будет принимать список названий городов, а возвращать новый список, в котором в каждой строке первая буква будет заглавной, а все остальные строчные.
"""

list_cities = ["москва", "иЖЕВСк", "Владивосток", "новосибирсК", "мУРМАНСК"]

def task_1(list):
    return [city.capitalize() for city in list]

new_list_cities = task_1(list_cities)  # TODO вызвать функцию и получить новый результат исходного списка list_cities

print(new_list_cities)  # ['Москва', 'Ижевск', 'Владивосток', 'Новосибирск', 'Мурманск']

"""##### ***Задача 2. Отфильтровать города с населением больше 1 млн. человек.***

Написать функцию task_2, которая будет принимать два аргумента список городов и численность населения.  
Функция должна возвращать новый отфильтрованный список городов, где остались города только с население больше 1 млн. человек


"""

list_dict_cities = [
    {
        "name": "Москва",
        "population": 12 * 10 ** 6,
    },
    {
        "name": "Санкт-Петербург",
        "population": 5 * 10 ** 6,
    },
    {
        "name": "Ижевск",
        "population": 0.6 * 10 ** 6,
    },
]

filter_population = 10 ** 6

def task_2(list, filter):  # TODO написать функцию task_2
    return [city for city in list if city["population"] >= filter]
    
new_list_dict_cities = task_2(list_dict_cities, filter_population)  # TODO вызвать функцию и передать в неё значения list_dict_cities и filter_population

print(new_list_dict_cities)  # [{'name': 'Москва', 'population': 12000000}, {'name': 'Санкт-Петербург', 'population': 5000000}]

"""##### ***Задача 3. Найти общие города среди двух групп и отсортировать их в алфавитном порядке.***

Написать функцию task_3, которая будет принимать 2 списка городов, а возвращать новый список, в котором будут города, которые есть в двух группах.  
Результат функции должен быть отсортирован в алфавитном порядке. 

"""

first_group = ["Москва", 'Владивосток', "Санкт-Петербург"]
second_group = ['Новосибирск', "Ижевск", "Санкт-Петербург", "Москва"]

def task_3(first, second):  # TODO Написать функцию task_3
    return [city for city in first if city in second]
common_cities = task_3(first_group, second_group)  # TODO вызвать функцию и передать в неё значения fisrt_group и second_group

print(sorted(common_cities))  # ['Москва', 'Санкт-Петербург'] #Москва в алфавитном порядке идет раньше Санкт-Петербурга

"""##### ***Задача 4. Найти количество упоминаний заданного города.***

У списка есть метод `count`, этот метод принимает значение,  
и считает сколько раз он содержится в списке.  

Написать функцию `task_4`, которая принимает два аргумента список городов,  
где нужно искать заданный город.  
И искомый город, количество упоминаний которого нужно подсчитать.
Результатом должно быть количество вхождений города в списке.

Города записанные в разных регистрах, считаются одинаковыми.
"""

list_cities = [  # список городов
    'Новосибирск',
    'Владивосток',
    'Москва',
    'санкт-петербург',
    'Владивосток',
    'Москва',
    'Санкт-Петербург',
    'Москва',
    'Новосибирск',
    'Владивосток',
    'Ижевск',
    'Владивосток',
    'Ижевск',
    'САНКТ-ПЕТЕРБУРГ',
    'Владивосток',
    'Новосибирск',
    'Владивосток',
    'Ижевск',
    'Москва',
    'Санкт-Петербург'
]
find_city = 'Санкт-Петербург'  # искомый город

def task_4(list, city): # написать функцию task_4
    a = [c.upper() for c in list]
    return a.count(city.upper())
count_cities = task_4(list_cities, find_city)  # TODO вызвать функцию и передать в неё значения list_cities и find_city

print(count_cities)  # 4

"""##### ***Задача 5. Средний индекс озеленения.***

Дан список словарей территорий, где `territory_area` - площадь территории, а `green_zones` список площадей зеленых зон.  
Написать две функции:
- первая будет принимать исходный список городов, и возвращать новый список словарей, в котором для каждой территории посчитан индекс индекс озеленения, как отношение площади зеленых зон к площади территории. Новые словари в списке должен содержать название территории и её индекс озеленения. 
- вторая функция принимает список словарей, в которых посчитаны индексы озеленения для каждой территории и возвращает средний индекс озеленения по всем территориям. 
"""

list_territories = [
    {
        "territory_name": "Пушкин",
        "territory_area": 28676,
        "green_zones": [302, 487, 420, 325, 471, 363, 404]
    },
    {
        "territory_name": "Павловск",
        "territory_area": 21025,
        "green_zones": [360, 375, 223, 258, 345, 296, 303]
    },
    {
        "territory_name": "Петергоф",
        "territory_area": 44274,
        "green_zones": [364, 447, 438, 223, 336, 431, 442]
    },
]

# TODO написать функцию, которая будет высчитывать индексы озеленения для каждой территории

# TODO написать функцию, которая будет высчитывать средний индекс озеленения по всем территориям

# TODO распечатать результат округленный до 4 знаков после запятой
def green_ind(list):
    for ter in list: # не получилось написать через списочное выражение
        name = ''
        area = ''
        zone = 0
        name = ter["territory_name"]
        area = ter["territory_area"]
        for el in ter["green_zones"]:
            zone += el
        green_index = area / zone
        territories[name] = round(green_index, 4) # пришлось оркуглять до 4х знаков после запятой здесь
def all_green_index(list):
    areas = 0
    zones = 0
    for ter in list:
        areas += ter["territory_area"]
        zone = 0
        for el in ter['green_zones']:
            zone+= el
        zones+= zone    
    all_green_ind = areas / zones
    return all_green_ind
territories = {}    
green_ind(list_territories)
for name, index in territories.items():
    print(f'Место - {name}. Индекс озеленения - {index}') # не получилось добавить округление в редактируемой строке, из-за этого в словаре неполное значение индекса озеленения
print('Общий индекс озеленения =', round(all_green_index(list_territories), 4))

#второй вариант подсчета по названию территории
# def green(name, list):
#     area = 0
#     zone = 0
#     for ter in list:
#         if name == ter["territory_name"]:
#             area = ter["territory_area"]
#             for el in ter["green_zones"]:
#                 zone += el
#     green_index = area / zone
#     return green_index
# в таком варианте нужно вызывать функцию и передавать туда название территории, наверно это неправильный вариант
# pushkin = green("Пушкин", list_territories)
# territories['Пушкин'] = round(pushkin, 4)
# pavlovsk = green("Павловск", list_territories)
# territories['Павловск'] = round(pavlovsk, 4)
# petergof = green("Петергоф", list_territories)
# territories['Петергоф'] = round(petergof, 4)